<p> </p>
<p>
<script src="https://cdn.rawgit.com/google/code-prettify/master/loader/run_prettify.js?skin=desert"></script>
</p>
<style><!--
li.L0, li.L1, li.L2, li.L3,
li.L5, li.L6, li.L7, li.L8 {
  list-style-type: decimal !important;
}
    li.L1,
    li.L3,
    li.L5,
    li.L7,
    li.L9 { background: #303030 }
--></style>
<p> </p>
<p>[:contents]</p>
<p> </p>
<p> </p>
<h3>0: 参考</h3>
<p> 【A】pr0cfsさんのwriteup</p>
<p><iframe class="embed-card embed-webcard" style="display: block; width: 100%; height: 155px; max-width: 500px; margin: 10px 0px;" title="The Plight of TTY in the Linux Kernel" src="https://hatenablog-parts.com/embed?url=https%3A%2F%2Fpr0cf5.github.io%2Fctf%2F2020%2F03%2F09%2Fthe-plight-of-tty-in-the-linux-kernel.html" frameborder="0" scrolling="no"></iframe><cite class="hatena-citation"><a href="https://pr0cf5.github.io/ctf/2020/03/09/the-plight-of-tty-in-the-linux-kernel.html">pr0cf5.github.io</a></cite></p>
<p>【B】作問者さんのwriteup</p>
<p><iframe class="embed-card embed-webcard" style="display: block; width: 100%; height: 155px; max-width: 500px; margin: 10px 0px;" title="[zer0pts CTF 2020] meowmow - HackMD" src="https://hatenablog-parts.com/embed?url=https%3A%2F%2Fhackmd.io%2F%40ptr-yudai%2FrJp1TpbBU%C2%A0" frameborder="0" scrolling="no"></iframe><cite class="hatena-citation"><a href="https://hackmd.io/@ptr-yudai/rJp1TpbBU ">hackmd.io</a></cite></p>
<p> </p>
<p>【C】kernel pwn 全般に関する pr0cfs さんの素晴らしい解説</p>

</figure>
<p> </p>
<h5>GDBでアタッチ</h5>
<p>それでは最後にGDBでデバッグできる状態にする</p>
<p>既に起動スクリプトの中でQEMUを -s オプション付きで起動しているため、localhostの1234ポートに接続することでデバッガをアタッチできる</p>
<p>尚、GDBの起動は上でビルドした対象の Kernel Tree の中で行い、そのトップディレクトリに自前ビルドしたモジュール(.ko)も置いておく</p>
<p>そうすると、Kernelが提供するGDBスクリプトによって lx-symbols コマンドが使えるようになる</p>
<pre class="prettyprint linenums">$ pwd
/home/wataru/linux-stable
$ ls | grep memo
-rw-rw-r--   1 wataru wataru    212544 Jul 22 21:31 memo.ko
$ pwndbg ./vmlinux
pwndbg&gt; target remote :1234
pwndbg&gt; lx-symbols
loading vmlinux
scanning for modules in /home/wataru/linux-stable
loading @0xffffffffa0000000: /home/wataru/linux-stable/memo.ko
pwndbg&gt; b mod_open
Breakpoint 1 at 0xffffffffa0000140: mod_open. (2 locations)
</pre>
<p>すると、以下のようにいつもどおりのデバッグができるようになる</p>
<p>尚、デバッグ環境を整えるためにはkernelのビルド時に諸々の設定をする必要があるため、これも上に挙げたリポジトリのファイルを参照のこと</p>
<figure class="figure-image figure-image-fotolife mceNonEditable" title="ユーザランドと同様にデバッグできているの巻">
<p><img src="https://cdn-ak.f.st-hatena.com/images/fotolife/s/smallkirby/20200722/20200722214245.png" alt="f:id:smallkirby:20200722214245p:plain" title="f:id:smallkirby:20200722214245p:plain" class="hatena-fotolife" itemprop="image" /></p>
<figcaption class="mceEditable">ユーザランドと同様にデバッグできているの巻</figcaption>
</figure>
<p> </p>
<h5>おまけ</h5>
<p>配布された bzImage を展開して何かを調べたい場合には以下の通り</p>
<p><iframe class="embed-card embed-webcard" style="display: block; width: 100%; height: 155px; max-width: 500px; margin: 10px 0px;" title="torvalds/linux" src="https://hatenablog-parts.com/embed?url=https%3A%2F%2Fgithub.com%2Ftorvalds%2Flinux%2Fblob%2Fmaster%2Fscripts%2Fextract-vmlinux" frameborder="0" scrolling="no"></iframe><cite class="hatena-citation"><a href="https://github.com/torvalds/linux/blob/master/scripts/extract-vmlinux">github.com</a></cite></p>
<p> </p>
<p>vanila gdb ではなく何らかの plugin (今回の場合pwndbg/peda) を使用した場合、デバッグ時に何かしら不都合が出てくる可能性もあるらしい (今回は何も困らなかった)</p>
<p> </p>
<p> </p>
<h3>3.Bugs</h3>
<p>カーネルモジュールのソースコードを見ると、明らかな heap overflowがある</p>
<p> </p>
<p> </p>
<p>これを利用して heap 領域にある kernel symbol を leak する</p>
<p>以下の記事に kernel pwn で使える構造体がまとまっている</p>
<p><iframe class="embed-card embed-blogcard" style="display: block; width: 100%; height: 190px; max-width: 500px; margin: 10px 0px;" title="Kernel Exploitで使える構造体集 - CTFするぞ" src="https://hatenablog-parts.com/embed?url=https%3A%2F%2Fptr-yudai.hatenablog.com%2Fentry%2F2020%2F03%2F16%2F165628" frameborder="0" scrolling="no"></iframe><cite class="hatena-citation"><a href="https://ptr-yudai.hatenablog.com/entry/2020/03/16/165628#timerfd_ctx">ptr-yudai.hatenablog.com</a></cite></p>
<p> </p>
<p>隣接するバッファの値しか読み書きできないという都合上、選択する構造体は「任意のタイミングでallocすることができる」必要がある</p>
<p>また、モジュールが作るバッファのサイズは 0x400 であるため、スラブとして kmalloc-1024 が使われる</p>
<p>よって今回はサイズ0x2e4で同様に kmalloc-1024 が使われる tty_struct を利用することにする</p>
<p>この構造体は /dev/ptmx を open() すると alloc される</p>
<p>struct tty_struct のメンバとサイズ・オフセットは以下のとおりである</p>
<pre class="prettyprint linenums">pwndbg&gt; ptype /o struct tty_struct
/* offset    |  size */  type = struct tty_struct {
/*    0      |     4 */    int magic;
/*    4      |     4 */    struct kref {
/*    4      |     4 */        refcount_t refcount;

                               /* total size (bytes):    4 */
                           } kref;
/*    8      |     8 */    struct device *dev;
/*   16      |     8 */    struct tty_driver *driver;
/*   24      |     8 */    const struct tty_operations *ops;
/*   32      |     4 */    int index;
/* XXX  4-byte hole  */
/*   40      |    48 */    struct ld_semaphore {
/*   40      |     8 */        atomic_long_t count;
/*   48      |     0 */        raw_spinlock_t wait_lock;
/*   48      |     4 */        unsigned int wait_readers;
/* XXX  4-byte hole  */
/*   56      |    16 */        struct list_head {
/*   56      |     8 */            struct list_head *next;
/*   64      |     8 */            struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } read_wait;
/*   72      |    16 */        struct list_head {
/*   72      |     8 */            struct list_head *next;
/*   80      |     8 */            struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } write_wait;

                               /* total size (bytes):   48 */
                           } ldisc_sem;
/*   88      |     8 */    struct tty_ldisc *ldisc;
/*   96      |    24 */    struct mutex {
/*   96      |     8 */        atomic_long_t owner;
/*  104      |     0 */        spinlock_t wait_lock;
/*  104      |    16 */        struct list_head {
/*  104      |     8 */            struct list_head *next;
/*  112      |     8 */            struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } wait_list;

                               /* total size (bytes):   24 */
                           } atomic_write_lock;
/*  120      |    24 */    struct mutex {
/*  120      |     8 */        atomic_long_t owner;
/*  128      |     0 */        spinlock_t wait_lock;
/*  128      |    16 */        struct list_head {
/*  128      |     8 */            struct list_head *next;
/*  136      |     8 */            struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } wait_list;

                               /* total size (bytes):   24 */
                           } legacy_mutex;
/*  144      |    24 */    struct mutex {
/*  144      |     8 */        atomic_long_t owner;
/*  152      |     0 */        spinlock_t wait_lock;
/*  152      |    16 */        struct list_head {
/*  152      |     8 */            struct list_head *next;
/*  160      |     8 */            struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } wait_list;

                               /* total size (bytes):   24 */
                           } throttle_mutex;
/*  168      |    24 */    struct rw_semaphore {
/*  168      |     8 */        atomic_long_t count;
/*  176      |    16 */        struct list_head {
/*  176      |     8 */            struct list_head *next;
/*  184      |     8 */            struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } wait_list;
/*  192      |     0 */        raw_spinlock_t wait_lock;

                               /* total size (bytes):   24 */
                           } termios_rwsem;
/*  192      |    24 */    struct mutex {
/*  192      |     8 */        atomic_long_t owner;
/*  200      |     0 */        spinlock_t wait_lock;
/*  200      |    16 */        struct list_head {
/*  200      |     8 */            struct list_head *next;
/*  208      |     8 */            struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } wait_list;

                               /* total size (bytes):   24 */
                           } winsize_mutex;
/*  216      |     0 */    spinlock_t ctrl_lock;
/*  216      |     0 */    spinlock_t flow_lock;
/*  216      |    44 */    struct ktermios {
/*  216      |     4 */        tcflag_t c_iflag;
/*  220      |     4 */        tcflag_t c_oflag;
/*  224      |     4 */        tcflag_t c_cflag;
/*  228      |     4 */        tcflag_t c_lflag;
/*  232      |     1 */        cc_t c_line;
/*  233      |    19 */        cc_t c_cc[19];
/*  252      |     4 */        speed_t c_ispeed;
/*  256      |     4 */        speed_t c_ospeed;

                               /* total size (bytes):   44 */
                           } termios;
/*  260      |    44 */    struct ktermios {
/*  260      |     4 */        tcflag_t c_iflag;
/*  264      |     4 */        tcflag_t c_oflag;
/*  268      |     4 */        tcflag_t c_cflag;
/*  272      |     4 */        tcflag_t c_lflag;
/*  276      |     1 */        cc_t c_line;
/*  277      |    19 */        cc_t c_cc[19];
/*  296      |     4 */        speed_t c_ispeed;
/*  300      |     4 */        speed_t c_ospeed;

                               /* total size (bytes):   44 */
                           } termios_locked;
/*  304      |     8 */    struct termiox *termiox;
/*  312      |    64 */    char name[64];
/*  376      |     8 */    struct pid *pgrp;
/*  384      |     8 */    struct pid *session;
/*  392      |     8 */    unsigned long flags;
/*  400      |     4 */    int count;
/*  404      |     8 */    struct winsize {
/*  404      |     2 */        unsigned short ws_row;
/*  406      |     2 */        unsigned short ws_col;
/*  408      |     2 */        unsigned short ws_xpixel;
/*  410      |     2 */        unsigned short ws_ypixel;

                               /* total size (bytes):    8 */
                           } winsize;
/*  412: 0   |     8 */    unsigned long stopped : 1;
/*  412: 1   |     8 */    unsigned long flow_stopped : 1;
/* XXX  6-bit hole   */
/* XXX  3-byte hole  */
/*  416: 0   |     8 */    unsigned long unused : 62;
/* XXX  2-bit hole   */
/*  424      |     4 */    int hw_stopped;
/*  428: 0   |     8 */    unsigned long ctrl_status : 8;
/*  429: 0   |     8 */    unsigned long packet : 1;
/* XXX  7-bit hole   */
/* XXX  2-byte hole  */
/*  432: 0   |     8 */    unsigned long unused_ctrl : 55;
/* XXX  1-bit hole   */
/* XXX  1-byte hole  */
/*  440      |     4 */    unsigned int receive_room;
/*  444      |     4 */    int flow_change;
/*  448      |     8 */    struct tty_struct *link;
/*  456      |     8 */    struct fasync_struct *fasync;
/*  464      |    16 */    wait_queue_head_t write_wait;
/*  480      |    16 */    wait_queue_head_t read_wait;
/*  496      |    32 */    struct work_struct {
/*  496      |     8 */        atomic_long_t data;
/*  504      |    16 */        struct list_head {
/*  504      |     8 */            struct list_head *next;
/*  512      |     8 */            struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } entry;
/*  520      |     8 */        work_func_t func;

                               /* total size (bytes):   32 */
                           } hangup_work;
/*  528      |     8 */    void *disc_data;
/*  536      |     8 */    void *driver_data;
/*  544      |     0 */    spinlock_t files_lock;
/*  544      |    16 */    struct list_head {
/*  544      |     8 */        struct list_head *next;
/*  552      |     8 */        struct list_head *prev;

                               /* total size (bytes):   16 */
                           } tty_files;
/*  560      |     4 */    int closing;
/* XXX  4-byte hole  */
/*  568      |     8 */    unsigned char *write_buf;
/*  576      |     4 */    int write_cnt;
/* XXX  4-byte hole  */
/*  584      |    32 */    struct work_struct {
/*  584      |     8 */        atomic_long_t data;
/*  592      |    16 */        struct list_head {
/*  592      |     8 */            struct list_head *next;
/*  600      |     8 */            struct list_head *prev;

                                   /* total size (bytes):   16 */
                               } entry;
/*  608      |     8 */        work_func_t func;

                               /* total size (bytes):   32 */
                           } SAK_work;
/*  616      |     8 */    struct tty_port *port;

                           /* total size (bytes):  624 */
                         }
</pre>
<p> </p>
<p>この内、const struct tty_operations *ops; は vtable へのポインタとして kernel symbol を指しているため kernelbase の leak に利用することができる</p>
<p> </p>
<p>実際に /dev/ptmx を open したあとで上の構造体を確認してみると以下のようになった</p>
<p><img src="https://cdn-ak.f.st-hatena.com/images/fotolife/s/smallkirby/20200722/20200722233232.png" alt="f:id:smallkirby:20200722233232p:plain" title="f:id:smallkirby:20200722233232p:plain" class="hatena-fotolife" itemprop="image" /></p>
<p>opsは 0xffffffff816191e0 &lt;ptm_unix98_ops&gt; を指している</p>
<p>この時、kernelbase は以下の通り0xffffffff81000000 であったから、そのオフセットは 0x6191e0であることが分かる</p>
<figure class="figure-image figure-image-fotolife mceNonEditable" title="kernelbase">
